zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC54000/LPC54S016/iar/startup_LPC54S016.s
; -------------------------------------------------------------------------
;  @file:    startup_LPC54S016.s
;  @purpose: CMSIS Cortex-M4 Core Device Startup File
;            LPC54S016
;  @version: 2.0
;  @date:    2024-10-29
;  @build:   b250521
; -------------------------------------------------------------------------
;
; Copyright 1997-2016 Freescale Semiconductor, Inc.
; Copyright 2016-2025 NXP
; SPDX-License-Identifier: BSD-3-Clause
;
; The modules in this file are included in the libraries, and may be replaced
; by any user-defined modules that define the PUBLIC symbol _program_start or
; a user defined start symbol.
; To override the cstartup defined in the library, simply add your modified
; version to the workbench project.
;
; The vector table is normally located at address 0.
; When debugging in RAM, it can be located in RAM, aligned to at least 2^6.
; The name "__vector_table" has special meaning for C-SPY:
; it is where the SP start value is found, and the NVIC vector
; table register (VTOR) is initialized to this address if != 0.
;
; Cortex-M version
;

        MODULE  ?cstartup

        ;; Forward declaration of sections.
        SECTION CSTACK:DATA:NOROOT(3)
        SECTION RO:CODE:NOROOT(2)

        SECTION .intvec:CODE:NOROOT(2)

        EXTERN  __iar_program_start
        EXTERN  SystemInit
        PUBLIC  __vector_table
        PUBLIC  __vector_table_0x1c
        PUBLIC  __Vectors
        PUBLIC  __Vectors_End
        PUBLIC  __Vectors_Size

        DATA

__iar_init$$done:              ; The vector table is not needed
                      ; until after copy initialization is done

__vector_table
        DCD     sfe(CSTACK)
        DCD     Reset_Handler

        DCD     NMI_Handler                                   ;NMI Handler
        DCD     HardFault_Handler                             ;Hard Fault Handler
        DCD     MemManage_Handler                             ;MPU Fault Handler
        DCD     BusFault_Handler                              ;Bus Fault Handler
        DCD     UsageFault_Handler                            ;Usage Fault Handler
__vector_table_0x1c
        DCD     0                                             ;Reserved
        DCD     0xFFFFFFFF                                    ;ECRP
        DCD     0xEDDC94BD                                    ;Enhanced image marker, set to 0x0 for legacy boot
        DCD     0x160                                         ;Pointer to enhanced boot block, set to 0x0 for legacy boot
        DCD     SVC_Handler                                   ;SVCall Handler
        DCD     DebugMon_Handler                              ;Debug Monitor Handler
        DCD     0                                             ;Reserved
        DCD     PendSV_Handler                                ;PendSV Handler
        DCD     SysTick_Handler                               ;SysTick Handler

                                                              ;External Interrupts
        DCD     WDT_BOD_IRQHandler                            ;Windowed watchdog timer, Brownout detect
        DCD     DMA0_IRQHandler                               ;DMA controller
        DCD     GINT0_IRQHandler                              ;GPIO group 0
        DCD     GINT1_IRQHandler                              ;GPIO group 1
        DCD     PIN_INT0_IRQHandler                           ;Pin interrupt 0 or pattern match engine slice 0
        DCD     PIN_INT1_IRQHandler                           ;Pin interrupt 1or pattern match engine slice 1
        DCD     PIN_INT2_IRQHandler                           ;Pin interrupt 2 or pattern match engine slice 2
        DCD     PIN_INT3_IRQHandler                           ;Pin interrupt 3 or pattern match engine slice 3
        DCD     UTICK0_IRQHandler                             ;Micro-tick Timer
        DCD     MRT0_IRQHandler                               ;Multi-rate timer
        DCD     CTIMER0_IRQHandler                            ;Standard counter/timer CTIMER0
        DCD     CTIMER1_IRQHandler                            ;Standard counter/timer CTIMER1
        DCD     SCT0_IRQHandler                               ;SCTimer/PWM
        DCD     CTIMER3_IRQHandler                            ;Standard counter/timer CTIMER3
        DCD     FLEXCOMM0_IRQHandler                          ;Flexcomm Interface 0 (USART, SPI, I2C, FLEXCOMM)
        DCD     FLEXCOMM1_IRQHandler                          ;Flexcomm Interface 1 (USART, SPI, I2C, FLEXCOMM)
        DCD     FLEXCOMM2_IRQHandler                          ;Flexcomm Interface 2 (USART, SPI, I2C, FLEXCOMM)
        DCD     FLEXCOMM3_IRQHandler                          ;Flexcomm Interface 3 (USART, SPI, I2C, FLEXCOMM)
        DCD     FLEXCOMM4_IRQHandler                          ;Flexcomm Interface 4 (USART, SPI, I2C, FLEXCOMM)
        DCD     FLEXCOMM5_IRQHandler                          ;Flexcomm Interface 5 (USART, SPI, I2C,, FLEXCOMM)
        DCD     FLEXCOMM6_IRQHandler                          ;Flexcomm Interface 6 (USART, SPI, I2C, I2S,, FLEXCOMM)
        DCD     FLEXCOMM7_IRQHandler                          ;Flexcomm Interface 7 (USART, SPI, I2C, I2S,, FLEXCOMM)
        DCD     ADC0_SEQA_IRQHandler                          ;ADC0 sequence A completion.
        DCD     ADC0_SEQB_IRQHandler                          ;ADC0 sequence B completion.
        DCD     ADC0_THCMP_IRQHandler                         ;ADC0 threshold compare and error.
        DCD     DMIC0_IRQHandler                              ;Digital microphone and DMIC subsystem
        DCD     HWVAD0_IRQHandler                             ;Hardware Voice Activity Detector
        DCD     USB0_NEEDCLK_IRQHandler                       ;USB Activity Wake-up Interrupt
        DCD     USB0_IRQHandler                               ;USB device
        DCD     RTC_IRQHandler                                ;RTC alarm and wake-up interrupts
        DCD     FLEXCOMM10_IRQHandler                         ;Flexcomm Interface 10 (SPI, FLEXCOMM)
        DCD     Reserved47_IRQHandler                         ;Reserved interrupt
        DCD     PIN_INT4_IRQHandler                           ;Pin interrupt 4 or pattern match engine slice 4 int
        DCD     PIN_INT5_IRQHandler                           ;Pin interrupt 5 or pattern match engine slice 5 int
        DCD     PIN_INT6_IRQHandler                           ;Pin interrupt 6 or pattern match engine slice 6 int
        DCD     PIN_INT7_IRQHandler                           ;Pin interrupt 7 or pattern match engine slice 7 int
        DCD     CTIMER2_IRQHandler                            ;Standard counter/timer CTIMER2
        DCD     CTIMER4_IRQHandler                            ;Standard counter/timer CTIMER4
        DCD     RIT_IRQHandler                                ;Repetitive Interrupt Timer
        DCD     SPIFI0_IRQHandler                             ;SPI flash interface
        DCD     FLEXCOMM8_IRQHandler                          ;Flexcomm Interface 8 (USART, SPI, I2C, FLEXCOMM)
        DCD     FLEXCOMM9_IRQHandler                          ;Flexcomm Interface 9 (USART, SPI, I2C, FLEXCOMM)
        DCD     SDIO_IRQHandler                               ;SD/MMC
        DCD     CAN0_IRQ0_IRQHandler                          ;CAN0 interrupt0
        DCD     CAN0_IRQ1_IRQHandler                          ;CAN0 interrupt1
        DCD     CAN1_IRQ0_IRQHandler                          ;CAN1 interrupt0
        DCD     CAN1_IRQ1_IRQHandler                          ;CAN1 interrupt1
        DCD     USB1_IRQHandler                               ;USB1 interrupt
        DCD     USB1_NEEDCLK_IRQHandler                       ;USB1 activity
        DCD     ETHERNET_IRQHandler                           ;Ethernet
        DCD     ETHERNET_PMT_IRQHandler                       ;Ethernet power management interrupt
        DCD     ETHERNET_MACLP_IRQHandler                     ;Ethernet MAC interrupt
        DCD     Reserved68_IRQHandler                         ;Reserved interrupt
        DCD     LCD_IRQHandler                                ;LCD interrupt
        DCD     SHA_IRQHandler                                ;SHA interrupt
        DCD     SMARTCARD0_IRQHandler                         ;Smart card 0 interrupt
        DCD     SMARTCARD1_IRQHandler                         ;Smart card 1 interrupt
        DCD     Reserved73_IRQHandler                         ;Reserved interrupt
        DCD     PUF_IRQHandler                                ;PUF interrupt


        DCD     0  ; 0x12C PAD
        DCD     0  ; 0x130 PAD
        DCD     0  ; 0x134 PAD
        DCD     0  ; 0x138 PAD
        DCD     0  ; 0x13C PAD
        DCD     0  ; 0x130 PAD
        DCD     0  ; 0x144 PAD
        DCD     0  ; 0x148 PAD
        DCD     0  ; 0x14C PAD
        DCD     0  ; 0x150 PAD
        DCD     0  ; 0x154 PAD
        DCD     0  ; 0x158 PAD
        DCD     0  ; 0x15C PAD

